app/controllers/admin/users_controller.rb

  def edit

    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1