app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 0) LIMIT 1

  def create
    @user = User.new(params[:user])

	respond_to do |format|

     if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (NULL, '2011-05-09 12:55:33.263615', 'mike@what.com', '0248e0399b82458dd5c9d9d4f0ea7883c9a171dbb408dc58eba0a9d0b77f7fd1', 'mike', '76902c80333446c85ddbd78541b985c11098b7a5f7e53ba2f578922004089480', '2011-05-09 12:55:33.263615')

  def edit

    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 6) LIMIT 1

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 6) LIMIT 1
UPDATE "users" SET "email" = 'admin@domain.blurp', "encrypted_password" = '33cc617769db84b82fc580bb7ba2e1267acd3de85a9ae2b219508b7bd58725fb', "name" = 'admin', "updated_at" = '2011-05-09 11:11:43.756459' WHERE ("users"."id" = 6)

def destroy

  User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE ("users"."id" = 7)
SELECT "users".* FROM "users" WHERE ("users"."id" = 7) LIMIT 1